<a href="https://colab.research.google.com/github/RoseMwangi98/WEEK-4/blob/main/Moringa_Data_Science_Prep_W4_Independent_Project_2021_02_ROSE_MWANGI_Python_Notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

USING ELECTRIC CAR-SHARING SERVICE COMPANY TO UNDERSTAND ELECTRIC CAR USAGE OVER TIME.

IMPORT THE LIBRARY

In [ ]:
#import the pandas library 
import pandas as pd
#import the numpy library
import numpy as np
#import matplotlib library
import matplotlib.pyplot as plt

IMPORT AND PREVIEW OUR DATASET

In [ ]:
#to load our dataframe that we are going to use
df=pd.read_csv("Autolib_dataset.csv")
#to preview our dataset
df.head(3)

                            Address  Cars  Bluecar counter  ...  day  hour  minute
0               2 Avenue de Suffren     0                0  ...    8    11      43
1         145 Rue Raymond Losserand     6                6  ...    6     7      24
2  2 Avenue John Fitzgerald Kennedy     3                3  ...    3    20      14

[3 rows x 25 columns]

ACCESSING OUR DATAFRAME

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 25 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Address              5000 non-null   object
 1   Cars                 5000 non-null   int64
 2   Bluecar counter      5000 non-null   int64
 3   Utilib counter       5000 non-null   int64
 4   Utilib 1.4 counter   5000 non-null   int64
 5   Charge Slots         5000 non-null   int64
 6   Charging Status      5000 non-null   object
 7   City                 5000 non-null   object
 8   Displayed comment    111 non-null    object
 9   ID                   5000 non-null   object
 10  Kind                 5000 non-null   object
 11  Geo point            5000 non-null   object
 12  Postal code          5000 non-null   int64
 13  Public name          5000 non-null   object
 14  Rental status        5000 non-null   object
 15  Scheduled at         47 non-null     object
 16  Slots                5000 non-null   int64
 17  Station type         5000 non-null   object
 18  Status               5000 non-null   object
 19  Subscription status  5000 non-null   object
 20  year                 5000 non-null   int64
 21  month                5000 non-null   int64
 22  day                  5000 non-null   int64
 23  hour                 5000 non-null   int64
 24  minute               5000 non-null   int64
dtypes: int64(12), object(13)
memory usage: 976.7+ KB

In [ ]:
df.describe

<bound method NDFrame.describe of                                  Address  Cars  ...  hour  minute
0                    2 Avenue de Suffren     0  ...    11      43
1              145 Rue Raymond Losserand     6  ...     7      24
2       2 Avenue John Fitzgerald Kennedy     3  ...    20      14
3                 51 Rue EugÃ¨ne OudinÃ©     3  ...     4      37
4     6 avenue de la Porte de Champerret     3  ...    17      23
...                                  ...   ...  ...   ...     ...
4995                 8 avenue MÃ©nelotte     2  ...    11      26
4996                   37 rue de Dantzig     4  ...    16      56
4997                      142 rue du Bac     1  ...     7       1
4998         2 avenue du Val de Fontenay     2  ...    17      27
4999                 5 Rue Henry Brisson     4  ...    10       2

[5000 rows x 25 columns]>

      

Data cleaning involves the following  five steps

1.   Validity
2.   Accuracy
3. Completeness
4. Consistency
5. Uniformity

**VALIDITY OF THE DATA** In this step we drop irrelevant columnns,remove syntax errors and fix typos

In [ ]:
df.drop(['Displayed comment' ,'Cars','Address','Kind','Scheduled at','Charging Status' ,'Charge Slots' , 'Subscription status' ,'Status','Geo point','Public name', 'Station type'],axis=1,inplace=True)
df.head(2)

   Bluecar counter  Utilib counter  Utilib 1.4 counter  ... day hour  minute
0                0               0                   0  ...   8   11      43
1                6               0                   0  ...   6    7      24

[2 rows x 13 columns]

In [ ]:
#preview the remaining columns in our dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 13 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Bluecar counter     5000 non-null   int64
 1   Utilib counter      5000 non-null   int64
 2   Utilib 1.4 counter  5000 non-null   int64
 3   City                5000 non-null   object
 4   ID                  5000 non-null   object
 5   Postal code         5000 non-null   int64
 6   Rental status       5000 non-null   object
 7   Slots               5000 non-null   int64
 8   year                5000 non-null   int64
 9   month               5000 non-null   int64
 10  day                 5000 non-null   int64
 11  hour                5000 non-null   int64
 12  minute              5000 non-null   int64
dtypes: int64(10), object(3)
memory usage: 507.9+ KB

**ACCURACY** In this step we check if the sum of varoius columns adds up.

In [ ]:
#check for unique of the characters
df['Postal code'].unique()

array([75015, 75014, 93350, 75013, 75017, 75011, 92000, 75009, 75005,
       92800, 92260, 78150, 92150, 78000, 92240, 75007, 75010, 92130,
       75006, 75018, 75004, 75020, 92210, 92310, 95870, 94130, 75016,
       94000, 94800, 92500, 75012, 92390, 75003, 93100, 75019, 94220,
       92400, 92600, 92380, 75001, 93700, 92250, 91370, 93150, 75002,
       92170, 75008, 95880, 92330, 92300, 92100, 92290, 93500, 92190,
       92230, 94300, 94150, 92700, 94120, 93110, 92340, 94230, 94700,
       91570, 94140, 94500, 93600, 93200, 92350, 93310, 92140, 92220,
       92270, 78280, 93170, 92420, 94450, 94410, 93230, 78140, 94110,
       75116, 93400, 92360, 92410, 95100, 93130, 94160, 92200, 93390,
       93370, 92160, 93800, 92320, 91330, 93440, 94340, 93360, 92110,
       75112, 92120, 94370, 92370, 91400, 93260, 94100, 93300])

**CONSISTENCY** In this step we check for missing values ,missing row values and drop them in our dataset

In [ ]:
#check for non missing values in our data set
df.count()

Bluecar counter       5000
Utilib counter        5000
Utilib 1.4 counter    5000
City                  5000
ID                    5000
Postal code           5000
Rental status         5000
Slots                 5000
year                  5000
month                 5000
day                   5000
hour                  5000
minute                5000
dtype: int64

In [ ]:
#check for missing values in our dataframe
np.count_nonzero(df.isnull())
#our dataset is clean it does not contain any missing values in it

0

In [ ]:
#check for unique values in our dataset
df['Bluecar counter'].unique()

array([0, 6, 3, 1, 5, 4, 2, 7])

**CONSISTENCY** In this step we look for duplicates and drop them in our dataset.

In [ ]:
#check for duplicates in our data 
df.duplicated()
#our data does not contain duplicates.

0       False
1       False
2       False
3       False
4       False
        ...
4995    False
4996    False
4997    False
4998    False
4999    False
Length: 5000, dtype: bool

**UNIFORMITY**
This is the final step in our data cleaning processes it involves fixing messy columns,renaming columns and separting columns that we can separate.

In [ ]:
df['Date_Time'] = pd.to_datetime(df[['year','month','day','hour','minute']])
#df
df.head(4)

   Bluecar counter  Utilib counter  ...  minute           Date_Time
0                0               0  ...      43 2018-04-08 11:43:00
1                6               0  ...      24 2018-04-06 07:24:00
2                3               0  ...      14 2018-04-03 20:14:00
3                3               1  ...      37 2018-04-04 04:37:00

[4 rows x 14 columns]

In [ ]:
df.drop(['year','month','minute'],axis=1,inplace=True)
df.head()

   Bluecar counter  Utilib counter  ...  hour           Date_Time
0                0               0  ...    11 2018-04-08 11:43:00
1                6               0  ...     7 2018-04-06 07:24:00
2                3               0  ...    20 2018-04-03 20:14:00
3                3               1  ...     4 2018-04-04 04:37:00
4                3               0  ...    17 2018-04-08 17:23:00

[5 rows x 11 columns]

  **DATA ANALYSIS**
 We use our cleaned data for analysis and to obtained insights into our various questions.

In [ ]:
#Identify the most popular hour of the day for picking up a shared electric car (Bluecar) in the city of Paris over the month of April 2018.
df[df['City']=='Paris'].pivot_table(index=df['Date_Time'].dt.hour ,values = "Bluecar counter" , aggfunc ='sum')
#from our analysis we can find out our point popular time for returning a car is 9am

           Bluecar counter
Date_Time
0                      206
1                      207
2                      221
3                      242
4                      209
5                      235
6                      260
7                      225
8                      234
9                      250
10                     232
11                     201
12                     250
13                     207
14                     163
15                     218
16                     208
17                     187
18                     192
19                     193
20                     149
21                     268
22                     197
23                     191

In [ ]:
#Identify the most popular hour of the day for picking up a shared electric car (Bluecar) in the city of Paris over the month of April 2018.
df.pivot_table(index=df['Date_Time'].dt.hour ,values = "Bluecar counter" , aggfunc ='sum')
#from our output we can identify the most popular time  at 6am

           Bluecar counter
Date_Time
0                      483
1                      493
2                      559
3                      549
4                      512
5                      552
6                      608
7                      555
8                      472
9                      515
10                     475
11                     502
12                     491
13                     537
14                     418
15                     449
16                     463
17                     432
18                     427
19                     387
20                     411
21                     503
22                     441
23                     434

In [ ]:
df.head(2)

   Bluecar counter  Utilib counter  ...  hour           Date_Time
0                0               0  ...    11 2018-04-08 11:43:00
1                6               0  ...     7 2018-04-06 07:24:00

[2 rows x 11 columns]

In [ ]:
#What station is the most popular?
df.groupby(['ID','Rental status','Bluecar counter']).count()
#we can determine that our most popular station is yerres-charlesdegaulle-99

                                                              Utilib counter  ...  Date_Time
ID                             Rental status Bluecar counter                  ...
alfortville-blanqui-61         broken        0                             4  ...          4
alfortville-charlesdegaulle-16 operational   2                             1  ...          1
                                             3                             1  ...          1
                                             4                             2  ...          2
                                             6                             1  ...          1
...                                                                      ...  ...        ...
yerres-charlesdegaulle-99      operational   7                             2  ...          2
yerres-pierrebrossolette-92    operational   0                             3  ...          3
                                             5                             1  ...          1
                                             6                             1  ...          1
yerres-raymondpoincare-200     operational   2                             1  ...          1

[3130 rows x 8 columns]

In [ ]:
#What postal code is the most popular for picking up Blue cars? Does the most popular station belong to that postal code?
#Overall?
#At the most popular picking hour?
df.groupby(['Postal code','ID','City']).resample("T",on='Date_Time')['Bluecar counter'].sum().nlargest(8)
#the most popular code is 75011 and most popular time is 06:57:00

Postal code  ID                                City                  Date_Time
75011        paris-renault-2                   Paris                 2018-04-05 06:57:00    7
                                                                     2018-04-06 09:10:00    7
78000        versailles-bonneaventure-68       Versailles            2018-04-01 09:56:00    7
                                                                     2018-04-05 16:17:00    7
78140        velizyvillacoublay-pauldautier-2  VÃ©lizy-Villacoublay  2018-04-02 00:50:00    7
                                                                     2018-04-09 11:22:00    7
78150        lechesnay-pottier-7               Le Chesnay            2018-04-02 10:14:00    7
91330        yerres-charlesdegaulle-99         Yerres                2018-04-04 10:28:00    7
Name: Bluecar counter, dtype: int64